{"class_name": "Sequential", "keras_version": "2.1.4", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_6", "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 1], "filters": 64, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_8", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_7", "data_format": "channels_first", "padding": [[2, 2], [2, 2]]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [5, 5]}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_8", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "name": "conv2d_7", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_9", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_9", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "name": "conv2d_8", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_10", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [3, 3]}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_10", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "name": "conv2d_9", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_11", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_11", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "name": "conv2d_10", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "filters": 128, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_12", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_12", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_4", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [3, 3]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 1024, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_13", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 1024, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_14", "shared_axes": null, "alpha_constraint": null, "alpha_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_6", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 7, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}]}